apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_i2c.c
/****************************************************************************
 * arch/risc-v/src/gd32vw55x/gd32vw55x_i2c.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * The GD32VW55x I2C is the "new" GigaDevice I2C IP (it is not the same IP
 * as the GD32F4 I2C).  The bit timing is programmed through the single
 * TIMING register and the transfer itself is driven by the hardware state
 * machine: the address, the direction and the number of bytes are loaded
 * into CTL1 and the hardware generates START, the address phase, the byte
 * count reload and, in automatic end mode, the STOP condition.
 *
 * This driver implements the I2C master interface only.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/i2c/i2c_master.h>

#include <arch/board/board.h>

#include "riscv_internal.h"

#include "chip.h"
#include "gd32vw55x_clockconfig.h"
#include "gd32vw55x_gpio.h"
#include "gd32vw55x_i2c.h"
#include "hardware/gd32vw55x_rcu.h"

#if defined(CONFIG_GD32VW55X_I2C0) || defined(CONFIG_GD32VW55X_I2C1)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Timeout for a complete transfer */

#ifndef CONFIG_GD32VW55X_I2C_TIMEOSEC
#  define CONFIG_GD32VW55X_I2C_TIMEOSEC   (0)
#endif

#ifndef CONFIG_GD32VW55X_I2C_TIMEOMS
#  define CONFIG_GD32VW55X_I2C_TIMEOMS    (500)
#endif

/* CONFIG_GD32VW55X_I2C_TIMEOTICKS overrides the seconds/milliseconds pair
 * only when non-zero (its Kconfig default is 0); otherwise the timeout is
 * derived from the seconds/milliseconds values.  Note the Kconfig symbol is
 * always defined, so a plain #ifndef would leave it at the useless 0.
 */

#if CONFIG_GD32VW55X_I2C_TIMEOTICKS != 0
#  define I2C_TIMEOUT_TICKS  CONFIG_GD32VW55X_I2C_TIMEOTICKS
#else
#  define I2C_TIMEOUT_TICKS \
     (SEC2TICK(CONFIG_GD32VW55X_I2C_TIMEOSEC) + \
      MSEC2TICK(CONFIG_GD32VW55X_I2C_TIMEOMS))
#endif

/* Timeout, in loop counts, used while waiting for the bus to become idle */

#define I2C_BUSY_TIMEOUT      (100000)

/* GPIO configuration used to bit-bang the bus in gd32_i2c_reset() */

#define I2C_OUTPUT            (GPIO_CFG_MODE_OUTPUT | GPIO_CFG_PUPD_NONE | \
                               GPIO_CFG_OD | GPIO_CFG_SPEED_50MHZ | \
                               GPIO_CFG_OUTPUT_SET)

#define MKI2C_OUTPUT(p)       (((p) & (GPIO_CFG_PORT_MASK | \
                                       GPIO_CFG_PIN_MASK)) | I2C_OUTPUT)

/* The interrupts that are used by this driver */

#define I2C_INT_MASK          (I2C_CTL0_TIE | I2C_CTL0_RBNEIE | \
                               I2C_CTL0_NACKIE | I2C_CTL0_STPDETIE | \
                               I2C_CTL0_TCIE | I2C_CTL0_ERRIE)

/* Bit timing: the data setup and data hold times, expressed in prescaled
 * clock ticks.  These values are conservative and work for the standard,
 * fast and fast-plus modes.
 */

#define I2C_SCLDELY_VALUE     (4)
#define I2C_SDADELY_VALUE     (2)

/* Lower bound for the prescaled clock (4 MHz -> 250 ns period).  The
 * prescaler is never allowed below this, so the SDADEL/SCLDEL setup and hold
 * times stay above the analog-filter minimum of the IP; otherwise the master
 * hangs before the first clock.  At the 16 MHz kernel clock this forces
 * PSC = 3, as in the vendor BSP.
 */

#define I2C_PRESC_FREQ_MAX    (4000000)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Interrupt state */

enum gd32_intstate_e
{
  INTSTATE_IDLE = 0,      /* No I2C activity */
  INTSTATE_WAITING,       /* Waiting for a transfer to complete */
  INTSTATE_DONE           /* Interrupt activity complete */
};

/* I2C hardware configuration */

struct gd32_i2c_config_s
{
  uint32_t i2c_base;      /* I2C base address */
  uint32_t clk_freq;      /* Frequency of the I2C source clock */
  uint32_t scl_pin;       /* GPIO configuration of SCL */
  uint32_t sda_pin;       /* GPIO configuration of SDA */
  uint32_t rcu_en;        /* RCU clock enable bit */
  uint32_t rcu_rst;       /* RCU reset bit */
#ifndef CONFIG_I2C_POLLED
  int      event_irq;     /* Event IRQ number */
  int      error_irq;     /* Error IRQ number */
#endif
};

/* I2C device state */

struct gd32_i2c_priv_s
{
  const struct i2c_ops_s *ops;           /* Standard I2C operations */
  const struct gd32_i2c_config_s *config;

  int      refs;                         /* Reference count */
  mutex_t  lock;                         /* Mutual exclusion mutex */
#ifndef CONFIG_I2C_POLLED
  sem_t    sem_isr;                      /* Interrupt wait semaphore */
#endif
  volatile uint8_t intstate;             /* Interrupt handshake */

  uint32_t frequency;                    /* Current bus frequency */

