apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_i2c.c
  struct i2c_msg_s *msgv;                /* Message vector */
  int      msgc;                         /* Number of messages */
  int      msgid;                        /* Index of the current message */

  uint8_t *ptr;                          /* Current buffer position */
  int      dcnt;                         /* Bytes left in the message */
  volatile int result;                   /* Result of the transfer */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static inline uint32_t gd32_i2c_getreg(struct gd32_i2c_priv_s *priv,
                                       uint32_t offset);
static inline void gd32_i2c_putreg(struct gd32_i2c_priv_s *priv,
                                   uint32_t offset, uint32_t value);
static inline void gd32_i2c_modifyreg(struct gd32_i2c_priv_s *priv,
                                      uint32_t offset, uint32_t setbits,
                                      uint32_t clrbits);

static int  gd32_i2c_sem_waitdone(struct gd32_i2c_priv_s *priv);
static int  gd32_i2c_sem_waitidle(struct gd32_i2c_priv_s *priv);

static void gd32_i2c_setclock(struct gd32_i2c_priv_s *priv,
                              uint32_t frequency);
static void gd32_i2c_setbytenum(struct gd32_i2c_priv_s *priv);
static void gd32_i2c_startmsg(struct gd32_i2c_priv_s *priv);
static void gd32_i2c_finish(struct gd32_i2c_priv_s *priv, int result);

static int  gd32_i2c_isr_process(struct gd32_i2c_priv_s *priv);
#ifndef CONFIG_I2C_POLLED
static int  gd32_i2c_isr(int irq, void *context, void *arg);
#endif

static int  gd32_i2c_init(struct gd32_i2c_priv_s *priv);
static int  gd32_i2c_deinit(struct gd32_i2c_priv_s *priv);

static int  gd32_i2c_transfer(struct i2c_master_s *dev,
                              struct i2c_msg_s *msgs, int count);
#ifdef CONFIG_I2C_RESET
static int  gd32_i2c_reset(struct i2c_master_s *dev);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct i2c_ops_s g_i2c_ops =
{
  .transfer = gd32_i2c_transfer,
#ifdef CONFIG_I2C_RESET
  .reset    = gd32_i2c_reset,
#endif
};

#ifdef CONFIG_GD32VW55X_I2C0
static const struct gd32_i2c_config_s g_i2c0_config =
{
  .i2c_base   = GD32VW55X_I2C0_BASE,
  .clk_freq   = 16000000,      /* IRC16M kernel clock */
  .scl_pin    = GPIO_I2C0_SCL,
  .sda_pin    = GPIO_I2C0_SDA,
  .rcu_en     = RCU_APB1EN_I2C0EN,
  .rcu_rst    = RCU_APB1RST_I2C0RST,
#ifndef CONFIG_I2C_POLLED
  .event_irq  = GD32VW55X_IRQ_I2C0_EV,
  .error_irq  = GD32VW55X_IRQ_I2C0_ER,
#endif
};

static struct gd32_i2c_priv_s g_i2c0_priv =
{
  .ops        = &g_i2c_ops,
  .config     = &g_i2c0_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr    = SEM_INITIALIZER(0),
#endif
  .intstate   = INTSTATE_IDLE,
  .msgv       = NULL,
  .msgc       = 0,
  .msgid      = 0,
  .ptr        = NULL,
  .dcnt       = 0,
  .result     = OK,
};
#endif

#ifdef CONFIG_GD32VW55X_I2C1
static const struct gd32_i2c_config_s g_i2c1_config =
{
  .i2c_base   = GD32VW55X_I2C1_BASE,
  .clk_freq   = GD32VW55X_PCLK1_FREQ,  /* I2C1 has no clock mux: CK_APB1 */
  .scl_pin    = GPIO_I2C1_SCL,
  .sda_pin    = GPIO_I2C1_SDA,
  .rcu_en     = RCU_APB1EN_I2C1EN,
  .rcu_rst    = RCU_APB1RST_I2C1RST,
#ifndef CONFIG_I2C_POLLED
  .event_irq  = GD32VW55X_IRQ_I2C1_EV,
  .error_irq  = GD32VW55X_IRQ_I2C1_ER,
#endif
};

static struct gd32_i2c_priv_s g_i2c1_priv =
{
  .ops        = &g_i2c_ops,
  .config     = &g_i2c1_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr    = SEM_INITIALIZER(0),
#endif
  .intstate   = INTSTATE_IDLE,
  .msgv       = NULL,
  .msgc       = 0,
  .msgid      = 0,
  .ptr        = NULL,
  .dcnt       = 0,
  .result     = OK,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_i2c_getreg
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 ****************************************************************************/

static inline uint32_t gd32_i2c_getreg(struct gd32_i2c_priv_s *priv,
                                       uint32_t offset)
{
  return getreg32(priv->config->i2c_base + offset);
}

/****************************************************************************
 * Name: gd32_i2c_putreg
 *
 * Description:
 *   Put a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void gd32_i2c_putreg(struct gd32_i2c_priv_s *priv,
                                   uint32_t offset, uint32_t value)
{
  putreg32(value, priv->config->i2c_base + offset);
}

/****************************************************************************
 * Name: gd32_i2c_modifyreg
 *
 * Description:
 *   Modify a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void gd32_i2c_modifyreg(struct gd32_i2c_priv_s *priv,
                                      uint32_t offset, uint32_t setbits,
                                      uint32_t clrbits)
{
  modifyreg32(priv->config->i2c_base + offset, clrbits, setbits);
}

/****************************************************************************
 * Name: gd32_i2c_sem_waitdone
 *
 * Description:
 *   Wait for the transfer that is in progress to complete.  In the polled
 *   configuration the state machine is driven from this function.
 *
 * Returned Value:
 *   Zero (OK) if the transfer completed; a negated errno value on a
 *   timeout.
 *
 ****************************************************************************/

#ifndef CONFIG_I2C_POLLED
static int gd32_i2c_sem_waitdone(struct gd32_i2c_priv_s *priv)
{
  irqstate_t flags;
  int ret;

  flags = enter_critical_section();

  /* Signal the interrupt handler that we are waiting.  Interrupts are
   * currently disabled but will be re-enabled while
   * nxsem_tickwait_uninterruptible() sleeps.  Only arm the wait if the ISR
   * has not already completed the transfer between startmsg() and here --
   * otherwise WAITING would clobber a DONE that was already posted and the
   * wait would block until the timeout.
   */

  ret = OK;
  if (priv->intstate != INTSTATE_DONE)
    {
      priv->intstate = INTSTATE_WAITING;

      do
        {
          ret = nxsem_tickwait_uninterruptible(&priv->sem_isr,
                                             I2C_TIMEOUT_TICKS);
          if (ret < 0)
            {
              /* Break out of the loop on irrecoverable errors */

              break;
            }
        }
      while (priv->intstate != INTSTATE_DONE);
    }

