apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_i2c.c
  /* Disable the I2C interrupts */

  gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL0_OFFSET, 0, I2C_INT_MASK);

  priv->intstate = INTSTATE_IDLE;
  leave_critical_section(flags);

  return ret;
}
#else
static int gd32_i2c_sem_waitdone(struct gd32_i2c_priv_s *priv)
{
  clock_t timeout;
  clock_t start;
  clock_t elapsed;

  timeout  = I2C_TIMEOUT_TICKS;
  start    = clock_systime_ticks();
  priv->intstate = INTSTATE_WAITING;

  do
    {
      /* Poll by simply calling the interrupt handler.  A short pause keeps
       * the polling from hammering the status register faster than the bus
       * can advance between events.
       */

      gd32_i2c_isr_process(priv);
      up_udelay(2);

      elapsed = clock_systime_ticks() - start;
    }
  while (priv->intstate != INTSTATE_DONE && elapsed < timeout);

  /* Disable the I2C interrupt sources */

  gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL0_OFFSET, 0, I2C_INT_MASK);

  if (priv->intstate != INTSTATE_DONE)
    {
      priv->intstate = INTSTATE_IDLE;
      return -ETIMEDOUT;
    }

  priv->intstate = INTSTATE_IDLE;
  return OK;
}
#endif

/****************************************************************************
 * Name: gd32_i2c_sem_waitidle
 *
 * Description:
 *   Wait until the I2C bus is no longer busy
 *
 * Returned Value:
 *   Zero (OK) on success; -EBUSY if the bus never becomes idle
 *
 ****************************************************************************/

static int gd32_i2c_sem_waitidle(struct gd32_i2c_priv_s *priv)
{
  uint32_t timeout;

  for (timeout = 0; timeout < I2C_BUSY_TIMEOUT; timeout++)
    {
      if ((gd32_i2c_getreg(priv, GD32VW55X_I2C_STAT_OFFSET) &
           I2C_STAT_I2CBSY) == 0)
        {
          return OK;
        }
    }

  i2cerr("ERROR: The I2C bus is busy\n");
  return -EBUSY;
}

/****************************************************************************
 * Name: gd32_i2c_setclock
 *
 * Description:
 *   Set the I2C bit timing for the requested SCL frequency.
 *
 *   The SCL period is:
 *
 *     tSCL = (SCLL + 1 + SCLH + 1) x (PSC + 1) / fI2CCLK
 *
 *   A duty cycle of 50% is used in standard mode and of 33% (SCL high) in
 *   the fast and fast plus modes.
 *
 ****************************************************************************/

static void gd32_i2c_setclock(struct gd32_i2c_priv_s *priv,
                              uint32_t frequency)
{
  uint32_t i2cclk;
  uint32_t cycles;
  uint32_t regval;
  uint32_t sclh = 0;
  uint32_t scll = 0;
  uint32_t psc;

  /* Has the frequency changed? */

  if (frequency == priv->frequency || frequency == 0)
    {
      return;
    }

  i2cclk = priv->config->clk_freq;

  /* Find the smallest prescaler that keeps SCLL and SCLH in range, but never
   * below the one that bounds the prescaled clock to I2C_PRESC_FREQ_MAX (see
   * that definition for why).
   */

  psc = 0;
  if (i2cclk > I2C_PRESC_FREQ_MAX)
    {
      psc = (i2cclk + I2C_PRESC_FREQ_MAX - 1) / I2C_PRESC_FREQ_MAX - 1;
    }

  for (; psc < 16; psc++)
    {
      cycles = (i2cclk / (psc + 1)) / frequency;

      if (cycles < 4)
        {
          /* The requested frequency is too high for this source clock */

          break;
        }

      if (frequency > 100000)
        {
          sclh = cycles / 3;
        }
      else
        {
          sclh = cycles / 2;
        }

      scll = cycles - sclh;

      /* The register fields hold the period minus one */

      sclh = (sclh > 0) ? sclh - 1 : 0;
      scll = (scll > 0) ? scll - 1 : 0;

      if (sclh <= 255 && scll <= 255)
        {
          break;
        }
    }

  if (psc > 15)
    {
      psc  = 15;
      sclh = 255;
      scll = 255;
    }

  regval = I2C_TIMING_PSC(psc) |
           I2C_TIMING_SCLDELY(I2C_SCLDELY_VALUE) |
           I2C_TIMING_SDADELY(I2C_SDADELY_VALUE) |
           I2C_TIMING_SCLH(sclh) |
           I2C_TIMING_SCLL(scll);

  /* The TIMING register can only be written while the peripheral is
   * disabled.
   */

  gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL0_OFFSET, 0, I2C_CTL0_I2CEN);
  gd32_i2c_putreg(priv, GD32VW55X_I2C_TIMING_OFFSET, regval);
  gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL0_OFFSET, I2C_CTL0_I2CEN, 0);

  i2cinfo("Frequency %" PRIu32 " Hz: TIMING=%08" PRIx32 "\n",
          frequency, regval);

  priv->frequency = frequency;
}

/****************************************************************************
 * Name: gd32_i2c_nostart_next
 *
 * Description:
 *   Check if the message that follows the current one continues the same
 *   transfer without a (repeated) START condition.
 *
 ****************************************************************************/

static bool gd32_i2c_nostart_next(struct gd32_i2c_priv_s *priv)
{
  if (priv->msgid + 1 >= priv->msgc)
    {
      return false;
    }

  return (priv->msgv[priv->msgid + 1].flags & I2C_M_NOSTART) != 0;
}

/****************************************************************************
 * Name: gd32_i2c_setbytenum
 *
 * Description:
 *   Program the number of bytes of the next chunk of the current message
 *   and select the reload or the automatic end mode.
 *
 *   A message that is longer than 255 bytes, or that is continued by a
 *   message with the I2C_M_NOSTART flag, is transferred in reload mode: a
 *   TCR interrupt is generated after each chunk.
 *
 ****************************************************************************/

static void gd32_i2c_setbytenum(struct gd32_i2c_priv_s *priv)
{
  uint32_t regval;
  uint32_t bytenum;
  bool reload;
  bool last;

  bytenum = (priv->dcnt > I2C_BYTENUM_MAX) ? I2C_BYTENUM_MAX : priv->dcnt;
  reload  = (priv->dcnt > I2C_BYTENUM_MAX) || gd32_i2c_nostart_next(priv);
  last    = (priv->msgid == priv->msgc - 1);

  regval  = gd32_i2c_getreg(priv, GD32VW55X_I2C_CTL1_OFFSET);
  regval &= ~(I2C_CTL1_BYTENUM_MASK | I2C_CTL1_RELOAD | I2C_CTL1_AUTOEND);
  regval |= I2C_CTL1_BYTENUM(bytenum);

  if (reload)
    {
      regval |= I2C_CTL1_RELOAD;
    }
  else if (last)
    {
      /* The hardware generates the STOP condition when the last byte of the
       * last message has been transferred.
       */

      regval |= I2C_CTL1_AUTOEND;
    }

  gd32_i2c_putreg(priv, GD32VW55X_I2C_CTL1_OFFSET, regval);
}

/****************************************************************************
 * Name: gd32_i2c_startmsg
 *
 * Description:
 *   Start the message that priv->msgid refers to: program the slave
 *   address, the direction and the byte count, and request a START (or a
 *   repeated START) condition.
 *
 ****************************************************************************/

static void gd32_i2c_startmsg(struct gd32_i2c_priv_s *priv)
{
  struct i2c_msg_s *msg = &priv->msgv[priv->msgid];
  uint32_t regval;

