apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_i2c.c
  priv->ptr  = msg->buffer;
  priv->dcnt = msg->length;

  /* Set the slave address and the transfer direction */

  regval = gd32_i2c_getreg(priv, GD32VW55X_I2C_CTL1_OFFSET);
  regval &= ~(I2C_CTL1_SADDRESS_MASK | I2C_CTL1_TRDIR | I2C_CTL1_ADD10EN |
              I2C_CTL1_HEAD10R | I2C_CTL1_BYTENUM_MASK | I2C_CTL1_RELOAD |
              I2C_CTL1_AUTOEND);

  if ((msg->flags & I2C_M_TEN) != 0)
    {
      regval |= I2C_CTL1_SADDRESS(msg->addr & 0x3ff);
      regval |= I2C_CTL1_ADD10EN;
    }
  else
    {
      regval |= I2C_CTL1_SADDRESS((msg->addr & 0x7f) << 1);
    }

  if ((msg->flags & I2C_M_READ) != 0)
    {
      regval |= I2C_CTL1_TRDIR_READ;
    }

  gd32_i2c_putreg(priv, GD32VW55X_I2C_CTL1_OFFSET, regval);

  /* Program the byte count and the reload/automatic end mode */

  gd32_i2c_setbytenum(priv);

  /* Enable the interrupts and request the START condition */

  gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL0_OFFSET, I2C_INT_MASK, 0);
  gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL1_OFFSET, I2C_CTL1_START, 0);
}

/****************************************************************************
 * Name: gd32_i2c_finish
 *
 * Description:
 *   Terminate the transfer: save the result, disable the interrupts and
 *   wake up the waiting thread.
 *
 ****************************************************************************/

static void gd32_i2c_finish(struct gd32_i2c_priv_s *priv, int result)
{
  priv->result = result;

  /* Disable all of the interrupt sources */

  gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL0_OFFSET, 0, I2C_INT_MASK);

  priv->intstate = INTSTATE_DONE;

#ifndef CONFIG_I2C_POLLED
  nxsem_post(&priv->sem_isr);
#endif
}

/****************************************************************************
 * Name: gd32_i2c_isr_process
 *
 * Description:
 *   The common I2C interrupt logic.  It handles both the event and the
 *   error interrupts, and it is also called from the polled configuration.
 *
 ****************************************************************************/

static int gd32_i2c_isr_process(struct gd32_i2c_priv_s *priv)
{
  uint32_t status;

  status = gd32_i2c_getreg(priv, GD32VW55X_I2C_STAT_OFFSET);

  /* Check for a NACK from the slave */

  if ((status & I2C_STAT_NACK) != 0)
    {
      gd32_i2c_putreg(priv, GD32VW55X_I2C_STATC_OFFSET, I2C_STATC_NACKC);

      i2cerr("ERROR: NACK, addr=0x%02x\n", priv->msgv[priv->msgid].addr);

      /* Request the STOP condition.  If the automatic end mode is active
       * the hardware has already sent it, in which case this bit is
       * ignored.
       */

      gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL1_OFFSET,
                         I2C_CTL1_STOP, 0);

      gd32_i2c_finish(priv, -ENXIO);
      return OK;
    }

  /* Check for any of the bus errors */

  if ((status & I2C_STAT_ERRORS) != 0)
    {
      gd32_i2c_putreg(priv, GD32VW55X_I2C_STATC_OFFSET, I2C_STATC_ERRORS);

      i2cerr("ERROR: I2C error, STAT=0x%08" PRIx32 "\n", status);

      gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL1_OFFSET,
                         I2C_CTL1_STOP, 0);

      gd32_i2c_finish(priv, -EIO);
      return OK;
    }

  /* Transmit the next byte */

  if ((status & I2C_STAT_TI) != 0 && priv->dcnt > 0)
    {
      gd32_i2c_putreg(priv, GD32VW55X_I2C_TDATA_OFFSET, *priv->ptr++);
      priv->dcnt--;
    }

  /* Receive the next byte */

  if ((status & I2C_STAT_RBNE) != 0 && priv->dcnt > 0)
    {
      *priv->ptr++ = gd32_i2c_getreg(priv, GD32VW55X_I2C_RDATA_OFFSET) &
                     I2C_RDATA_MASK;
      priv->dcnt--;
    }

  /* Reload: the byte count of the previous chunk has been reached but the
   * transfer is not complete.
   */

  if ((status & I2C_STAT_TCR) != 0)
    {
      if (priv->dcnt == 0)
        {
          /* The current message is complete.  It must be continued by a
           * message with the I2C_M_NOSTART flag.
           */

          struct i2c_msg_s *next;

          if (priv->msgid + 1 >= priv->msgc)
            {
              gd32_i2c_finish(priv, -EINVAL);
              return OK;
            }

          next = &priv->msgv[priv->msgid + 1];

          /* The direction cannot be changed without a repeated START */

          if (((next->flags ^ priv->msgv[priv->msgid].flags) &
               I2C_M_READ) != 0)
            {
              i2cerr("ERROR: I2C_M_NOSTART cannot change direction\n");
              gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL1_OFFSET,
                                 I2C_CTL1_STOP, 0);
              gd32_i2c_finish(priv, -EINVAL);
              return OK;
            }

          priv->msgid++;
          priv->ptr  = next->buffer;
          priv->dcnt = next->length;
        }

      /* Program the byte count of the next chunk */

      gd32_i2c_setbytenum(priv);
    }

  /* Transfer complete: the current message has been transferred and the
   * automatic end mode is not active, so a repeated START is needed.
   */

  if ((status & I2C_STAT_TC) != 0)
    {
      if (priv->msgid + 1 < priv->msgc)
        {
          priv->msgid++;
          gd32_i2c_startmsg(priv);
        }
      else
        {
          /* Nothing left to do: generate the STOP condition */

          gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL1_OFFSET,
                             I2C_CTL1_STOP, 0);
        }
    }

  /* The STOP condition has been detected: the transfer is complete */

  if ((status & I2C_STAT_STPDET) != 0)
    {
      gd32_i2c_putreg(priv, GD32VW55X_I2C_STATC_OFFSET, I2C_STATC_STPDETC);
      gd32_i2c_finish(priv, priv->result);
    }

  return OK;
}

/****************************************************************************
 * Name: gd32_i2c_isr
 *
 * Description:
 *   The I2C event and error interrupt handler
 *
 ****************************************************************************/

#ifndef CONFIG_I2C_POLLED
static int gd32_i2c_isr(int irq, void *context, void *arg)
{
  struct gd32_i2c_priv_s *priv = (struct gd32_i2c_priv_s *)arg;

  DEBUGASSERT(priv != NULL);
  return gd32_i2c_isr_process(priv);
}
#endif

/****************************************************************************
 * Name: gd32_i2c_init
 *
 * Description:
 *   Set up the I2C hardware, so it is ready for use
 *
 ****************************************************************************/

static int gd32_i2c_init(struct gd32_i2c_priv_s *priv)
{
  const struct gd32_i2c_config_s *config = priv->config;

  /* Enable the I2C clock */

