apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_i2c.c
  modifyreg32(GD32VW55X_RCU_APB1EN, 0, config->rcu_en);

  /* Source the I2C0 kernel clock from IRC16M (16 MHz).  The protocol state
   * machine is clocked by this kernel clock (not the APB1 bus clock that
   * feeds the register interface).  With the APB1 default the prescaled
   * period is so short that the SDADEL/SCLDEL setup and hold times fall
   * below the analog-filter minimum of this I2C v2 IP, and the master hangs
   * with the START bit set and BUSY never asserting.  IRC16M gives a fixed,
   * in-spec 16 MHz reference (matching the vendor BSP), which is why
   * clk_freq is 16 MHz.
   */

  if (config->i2c_base == GD32VW55X_I2C0_BASE)
    {
      modifyreg32(GD32VW55X_RCU_CFG1, RCU_CFG1_I2C0SEL_MASK,
                  RCU_CFG1_I2C0SEL_IRC16M);
    }

  /* Reset the peripheral to be sure that it is in a known state */

  modifyreg32(GD32VW55X_RCU_APB1RST, 0, config->rcu_rst);
  modifyreg32(GD32VW55X_RCU_APB1RST, config->rcu_rst, 0);

  /* Configure the SCL and SDA pins */

  if (gd32_gpio_config(config->scl_pin) < 0)
    {
      return -EINVAL;
    }

  if (gd32_gpio_config(config->sda_pin) < 0)
    {
      gd32_gpio_unconfig(config->scl_pin);
      return -EINVAL;
    }

#ifndef CONFIG_I2C_POLLED
  /* Attach and enable the event and the error interrupts */

  irq_attach(config->event_irq, gd32_i2c_isr, priv);
  irq_attach(config->error_irq, gd32_i2c_isr, priv);

  up_enable_irq(config->event_irq);
  up_enable_irq(config->error_irq);
#endif

  /* The peripheral must be disabled while it is configured.  Use the
   * analog noise filter and no digital filter, and do not stretch the
   * clock in slave mode (this driver is master only).
   */

  gd32_i2c_putreg(priv, GD32VW55X_I2C_CTL0_OFFSET, 0);
  gd32_i2c_putreg(priv, GD32VW55X_I2C_CTL1_OFFSET, 0);

  /* Force the frequency to be re-programmed and set the default frequency
   * of 100 KHz.  This also enables the peripheral.
   */

  priv->frequency = 0;
  gd32_i2c_setclock(priv, 100000);

  return OK;
}

/****************************************************************************
 * Name: gd32_i2c_deinit
 *
 * Description:
 *   Shutdown the I2C hardware
 *
 ****************************************************************************/

static int gd32_i2c_deinit(struct gd32_i2c_priv_s *priv)
{
  const struct gd32_i2c_config_s *config = priv->config;

  /* Disable the peripheral */

  gd32_i2c_modifyreg(priv, GD32VW55X_I2C_CTL0_OFFSET, 0, I2C_CTL0_I2CEN);

  /* Unconfigure the GPIO pins */

  gd32_gpio_unconfig(config->scl_pin);
  gd32_gpio_unconfig(config->sda_pin);

#ifndef CONFIG_I2C_POLLED
  /* Disable and detach the interrupts */

  up_disable_irq(config->event_irq);
  up_disable_irq(config->error_irq);

  irq_detach(config->event_irq);
  irq_detach(config->error_irq);
#endif

  /* Disable the clock of the peripheral */

  modifyreg32(GD32VW55X_RCU_APB1EN, config->rcu_en, 0);

  priv->frequency = 0;

  return OK;
}

/****************************************************************************
 * Name: gd32_i2c_transfer
 *
 * Description:
 *   Generic I2C transfer function
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   msgs  - The vector of the messages to be transferred
 *   count - The number of messages in the vector
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure
 *
 ****************************************************************************/

static int gd32_i2c_transfer(struct i2c_master_s *dev,
                             struct i2c_msg_s *msgs, int count)
{
  struct gd32_i2c_priv_s *priv = (struct gd32_i2c_priv_s *)dev;
  int ret;

  DEBUGASSERT(priv != NULL && msgs != NULL && count > 0);

  /* The first message cannot continue a previous transfer */

  if ((msgs[0].flags & I2C_M_NOSTART) != 0)
    {
      return -EINVAL;
    }

  /* Get exclusive access to the I2C bus */

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* Wait for the bus to become idle */

  ret = gd32_i2c_sem_waitidle(priv);
  if (ret < 0)
    {
      goto errout;
    }

  /* Set up the message vector */

  priv->msgv   = msgs;
  priv->msgc   = count;
  priv->msgid  = 0;
  priv->ptr    = NULL;
  priv->dcnt   = 0;
  priv->result = OK;

  /* Select the frequency of the first message */

  gd32_i2c_setclock(priv, msgs[0].frequency);

  /* Clear any pending status flags */

  gd32_i2c_putreg(priv, GD32VW55X_I2C_STATC_OFFSET,
                  I2C_STATC_ERRORS | I2C_STATC_NACKC | I2C_STATC_STPDETC);

  /* Start the first message and wait for the transfer to complete */

  gd32_i2c_startmsg(priv);

  ret = gd32_i2c_sem_waitdone(priv);
  if (ret < 0)
    {
      i2cerr("ERROR: Timed out: STAT=0x%08" PRIx32 "\n",
             gd32_i2c_getreg(priv, GD32VW55X_I2C_STAT_OFFSET));

      /* Reset the peripheral to abort the transfer */

      gd32_i2c_deinit(priv);
      gd32_i2c_init(priv);

      ret = -ETIMEDOUT;
    }
  else
    {
      ret = priv->result;
    }

errout:
  priv->msgv = NULL;
  priv->msgc = 0;

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: gd32_i2c_reset
 *
 * Description:
 *   Perform an I2C bus reset in an attempt to break loose stuck I2C devices
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_RESET
static int gd32_i2c_reset(struct i2c_master_s *dev)
{
  struct gd32_i2c_priv_s *priv = (struct gd32_i2c_priv_s *)dev;
  unsigned int clock_count;
  unsigned int stretch_count;
  uint32_t scl_gpio;
  uint32_t sda_gpio;
  uint32_t frequency;
  int ret;

  DEBUGASSERT(priv != NULL && priv->refs > 0);

  /* Lock out other clients */

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = -EIO;

  /* Save the current frequency */

  frequency = priv->frequency;

  /* De-init the port */

  gd32_i2c_deinit(priv);

  /* Use a GPIO configuration to un-wedge the bus */

  scl_gpio = MKI2C_OUTPUT(priv->config->scl_pin);
  sda_gpio = MKI2C_OUTPUT(priv->config->sda_pin);

  gd32_gpio_config(scl_gpio);
  gd32_gpio_config(sda_gpio);

  /* Let SDA go high */

  gd32_gpio_write(sda_gpio, 1);

