apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_i2c.c
  /* Clock the bus until any slaves currently driving it let it go */

  clock_count = 0;
  while (!gd32_gpio_read(sda_gpio))
    {
      /* Give up if we have tried too hard */

      if (clock_count++ > 10)
        {
          goto out;
        }

      /* Sniff to make sure that the clock stretching has finished.  If the
       * bus never relaxes, the reset has failed.
       */

      stretch_count = 0;
      while (!gd32_gpio_read(scl_gpio))
        {
          if (stretch_count++ > 10)
            {
              goto out;
            }

          up_udelay(10);
        }

      /* Drive SCL low */

      gd32_gpio_write(scl_gpio, 0);
      up_udelay(10);

      /* Drive SCL high again */

      gd32_gpio_write(scl_gpio, 1);
      up_udelay(10);
    }

  /* Generate a START followed by a STOP to reset the slave state
   * machines.
   */

  gd32_gpio_write(sda_gpio, 0);
  up_udelay(10);
  gd32_gpio_write(scl_gpio, 0);
  up_udelay(10);
  gd32_gpio_write(scl_gpio, 1);
  up_udelay(10);
  gd32_gpio_write(sda_gpio, 1);
  up_udelay(10);

  /* Revert the GPIO configuration */

  gd32_gpio_unconfig(sda_gpio);
  gd32_gpio_unconfig(scl_gpio);

  /* Re-init the port and restore the frequency */

  gd32_i2c_init(priv);
  gd32_i2c_setclock(priv, frequency);

  ret = OK;

out:
  nxmutex_unlock(&priv->lock);
  return ret;
}
#endif /* CONFIG_I2C_RESET */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_i2cbus_initialize
 *
 * Description:
 *   Initialize the selected I2C port and return a unique instance of
 *   struct i2c_master_s
 *
 * Input Parameters:
 *   port - The I2C port number: 0 (I2C0) or 1 (I2C1)
 *
 * Returned Value:
 *   Valid I2C device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct i2c_master_s *gd32_i2cbus_initialize(int port)
{
  struct gd32_i2c_priv_s *priv = NULL;
  irqstate_t flags;

  switch (port)
    {
#ifdef CONFIG_GD32VW55X_I2C0
    case 0:
      priv = &g_i2c0_priv;
      break;
#endif
#ifdef CONFIG_GD32VW55X_I2C1
    case 1:
      priv = &g_i2c1_priv;
      break;
#endif
    default:
      i2cerr("ERROR: Unsupported I2C port: %d\n", port);
      return NULL;
    }

  /* Initialize the private data of the device, if it has not been done */

  flags = enter_critical_section();

  if (priv->refs++ == 0)
    {
      if (gd32_i2c_init(priv) < 0)
        {
          priv->refs--;
          leave_critical_section(flags);
          return NULL;
        }
    }

  leave_critical_section(flags);

  return (struct i2c_master_s *)priv;
}

/****************************************************************************
 * Name: gd32_i2cbus_uninitialize
 *
 * Description:
 *   De-initialize the selected I2C port and power down the device
 *
 * Input Parameters:
 *   dev - Device structure as returned by gd32_i2cbus_initialize()
 *
 * Returned Value:
 *   OK on success; ERROR when the internal reference count mismatches or
 *   the dev pointer is invalid
 *
 ****************************************************************************/

int gd32_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct gd32_i2c_priv_s *priv = (struct gd32_i2c_priv_s *)dev;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  flags = enter_critical_section();

  if (--priv->refs > 0)
    {
      leave_critical_section(flags);
      return OK;
    }

  leave_critical_section(flags);

  /* Disable power and other HW resources (GPIO pins) */

  gd32_i2c_deinit(priv);

  return OK;
}

#endif /* CONFIG_GD32VW55X_I2C0 || CONFIG_GD32VW55X_I2C1 */
